# Índice:
    
## 1 Groupby
.
## 2 Concatenação
.
## 3 Mesclar
.
## 4 Juntar

___

# 1. Groupby

O método groupby permite agrupar linhas de dados em conjunto e chamar funções agregadas

In [1]:
import pandas as pd
# Cria um DataFrame
data = {'Classe':['Júnior','Júnior','Pleno','Pleno','Sênior','Sênior'],
       'Nome':['Jorge','Carlos','Roberta','Patrícia','Bruno','Vera'],
       'Venda':[200,120,340,124,243,350]}

In [2]:
df = pd.DataFrame(data)

In [3]:
df

   Classe      Nome  Venda
0  Júnior     Jorge    200
1  Júnior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patrícia    124
4  Sênior     Bruno    243
5  Sênior      Vera    350

** Agora, você pode usar o método .group by () para agrupar as linhas em conjunto com base em um nome de coluna. Por exemplo, vamos agrupar com base na classe. Isso criará um objeto DataFrameGroupBy:**

In [34]:
df.groupby('Classe')

Você pode salvar este objeto como uma nova variável:

In [58]:
por_Classe = df.groupby("Classe")["Venda"]

E, em seguida, chamar métodos agregados do objeto:

In [64]:
display(por_Classe.sum())

Classe
Júnior    320
Pleno     464
Sênior    593
Name: Venda, dtype: int64

In [65]:
por_Classe.mean()

Classe
Júnior    160.0
Pleno     232.0
Sênior    296.5
Name: Venda, dtype: float64

Mais exemplos de métodos agregados:

In [66]:
por_Classe.std()

Classe
Júnior     56.568542
Pleno     152.735065
Sênior     75.660426
Name: Venda, dtype: float64

In [67]:
por_Classe.min()

Classe
Júnior    120
Pleno     124
Sênior    243
Name: Venda, dtype: int64

In [68]:
por_Classe.max()

Classe
Júnior    200
Pleno     340
Sênior    350
Name: Venda, dtype: int64

In [69]:
por_Classe.count()

Classe
Júnior    2
Pleno     2
Sênior    2
Name: Venda, dtype: int64

In [70]:
por_Classe.describe()

        count   mean         std    min     25%    50%     75%    max
Classe
Júnior    2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
Pleno     2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0
Sênior    2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0

In [71]:
por_Classe.describe().transpose()

Classe      Júnior       Pleno      Sênior
count     2.000000    2.000000    2.000000
mean    160.000000  232.000000  296.500000
std      56.568542  152.735065   75.660426
min     120.000000  124.000000  243.000000
25%     140.000000  178.000000  269.750000
50%     160.000000  232.000000  296.500000
75%     180.000000  286.000000  323.250000
max     200.000000  340.000000  350.000000

In [72]:
por_Classe.describe().transpose()['Sênior']

count      2.000000
mean     296.500000
std       75.660426
min      243.000000
25%      269.750000
50%      296.500000
75%      323.250000
max      350.000000
Name: Sênior, dtype: float64

# Mesclar, Juntar, e Concatenar


Existem três maneiras principais de combinar os DataFrames: mesclando, juntando e concatenando (merge, join e concat). Nesta palestra, discutiremos esses 3 métodos com exemplos.

____

### Exemplos de DataFrames

In [73]:
import pandas as pd

In [74]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [75]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [76]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [77]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [78]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [79]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

## 2. Concatenação

Concatenação basicamente cola DataFrames. Tenha em mente que as dimensões devem corresponder ao longo do eixo que você está concatenando. Você pode usar ** pd.concat ** e passar uma lista de DataFrames para concatenar juntos:

In [80]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [81]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

_____
## Outros DataFrames

In [82]:
esquerda = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
direita = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [83]:
esquerda

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [84]:
direita

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

## 3. Mesclar

A função ** mesclar ** permite que você mescle os quadros de dados juntos usando uma lógica semelhante à mesclagem de tabelas SQL juntas. Por exemplo:

In [85]:
pd.merge(esquerda,direita,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

Ou para mostrar um exemplo mais complicado:

In [86]:
esquerda = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
direita = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [87]:
pd.merge(esquerda, direita, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [88]:
pd.merge(esquerda, direita, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [89]:
pd.merge(esquerda, direita, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [90]:
pd.merge(esquerda, direita, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

## 4. Juntar
Juntar é um método conveniente para combinar as colunas de dois DataFrames indexados potencialmente diferentes em um único resultado DataFrame.

In [91]:
esquerda = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

direita = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [92]:
esquerda

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [93]:
direita

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [94]:
esquerda.join(direita)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [95]:
esquerda.join(direita, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# Diferença entre merge() e join()

### A principal diferença entre merge() e join() no pandas está na forma de junção. merge() combina DataFrames com base em colunas específicas, sendo mais flexível e indicado para junções complexas. Já join() usa o índice por padrão, sendo mais simples e adequado para junções rápidas quando os índices já estão alinhados. Ambos permitem especificar o tipo de junção com o parâmetro how.

In [97]:
# usando Merge()

import pandas as pd

df1 = pd.DataFrame({'key': [1, 2, 3], 'value1': ['A', 'B', 'C']})
df2 = pd.DataFrame({'key': [2, 3, 4], 'value2': ['X', 'Y', 'Z']})

# Junção baseada na coluna 'key'
result_merge = pd.merge(df1, df2, on='key', how='inner')
result_merge

   key value1 value2
0    2      B      X
1    3      C      Y

In [98]:
# usando Join()


df1 = pd.DataFrame({'value1': ['A', 'B', 'C']}, index=[1, 2, 3])
df2 = pd.DataFrame({'value2': ['X', 'Y', 'Z']}, index=[2, 3, 4])

# Junção baseada no índice
result_join = df1.join(df2, how='inner')
result_join

  value1 value2
2      B      X
3      C      Y